app/controllers/articles_controller.rb

INSERT INTO "articles" ("body", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)
---
  def create
    @article = Article.new(params[:article])

    respond_to do |format|
      if @article.save

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", "1"]]
---
  def load_article
    @article = Article.find(params[:id]) if params[:id]

SELECT "articles".* FROM "articles"
---
  def load_articles_with_caps
    @articles = Article.all